STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257F-DK/stm32mp257f_disco.c
  HAL_GPIO_Init(LED_PORT[Led], &GPIO_InitStruct);

  /* By default, turn off LED */
  HAL_GPIO_WritePin(LED_PORT[Led], LED_PIN[Led], GPIO_LED_OFF[Led]);
  return ret;
}

/**
  * @brief  DeInit LEDs.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t  BSP_LED_DeInit(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
  GPIO_InitTypeDef  gpio_init_structure;

  /* DeInit the GPIO_LED pin */
  gpio_init_structure.Pin = LED_PIN [Led];
  /* Turn off LED */
  HAL_GPIO_WritePin(LED_PORT [Led], (uint16_t)LED_PIN[Led], GPIO_LED_OFF[Led]);
  HAL_GPIO_DeInit(LED_PORT [Led], gpio_init_structure.Pin);

  /* BSP LED  MSP DeInit configuration*/
  if (BSP_LED_MspDeInit(Led) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_MSP_FAILURE;
  }

  return ret;
}

/**
  * @brief  MspInit LEDs.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval int32_t
  */
static int32_t BSP_LED_MspInit(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
  GPIO_TypeDef *led = LED_PORT[Led];
  uint32_t pin = LED_PIN[Led];

  /* Enable the GPIO_LED clock */
  if (Led == LED1 && !(LED1_GPIO_IS_CLK_ENABLED()))
  {
    if (RESMGR_STATUS_ACCESS_OK == ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(97)))
    {
      LED1_GPIO_CLK_ENABLE();
    }
  }
  else if (Led == LED2 && !(LED2_GPIO_IS_CLK_ENABLED()))
  {
    if (IS_DEVELOPER_BOOT_MODE())
    {
      HAL_PWREx_EnableSupply(PWR_PVM_VDDIO3);
    }
    if (RESMGR_STATUS_ACCESS_OK == ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(97)))
    {
      LED2_GPIO_CLK_ENABLE();
    }
  }
  else if (Led == LED3 && !(LED3_GPIO_IS_CLK_ENABLED()))
  {
    if (RESMGR_STATUS_ACCESS_OK == ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(97)))
    {
      LED3_GPIO_CLK_ENABLE();
    }
  }
  else if (Led == LED4 && !(LED4_GPIO_IS_CLK_ENABLED()))
  {
    if (RESMGR_STATUS_ACCESS_OK == ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(97)))
    {
      LED4_GPIO_CLK_ENABLE();
    }
  }


  if (!IS_DEVELOPER_BOOT_MODE())
  {
    if ((led == LED1_GPIO_PORT && pin == LED1_PIN &&
         ResMgr_Request(LED1_GPIO_RIF_RES_TYP_GPIO, LED1_GPIO_RIF_RES_NUM_GPIO) != RESMGR_STATUS_ACCESS_OK)
        || (led == LED2_GPIO_PORT && pin == LED2_PIN &&
            ResMgr_Request(LED2_GPIO_RIF_RES_TYP_GPIO, LED2_GPIO_RIF_RES_NUM_GPIO) != RESMGR_STATUS_ACCESS_OK)
        || (led == LED3_GPIO_PORT && pin == LED3_PIN &&
            ResMgr_Request(LED3_GPIO_RIF_RES_TYP_GPIO, LED3_GPIO_RIF_RES_NUM_GPIO) != RESMGR_STATUS_ACCESS_OK)
        || (led == LED4_GPIO_PORT && pin == LED4_PIN &&
            ResMgr_Request(LED4_GPIO_RIF_RES_TYP_GPIO, LED4_GPIO_RIF_RES_NUM_GPIO) != RESMGR_STATUS_ACCESS_OK))
    {
      ret = BSP_ERROR_MSP_FAILURE;
    }
  }
  return ret;
}

/**
  * @brief  MspDeInit LEDs.
  * @param  Led LED to be configured.
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval int32_t
  */
static int32_t BSP_LED_MspDeInit(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
  GPIO_TypeDef *led = LED_PORT[Led];
  uint32_t pin = LED_PIN[Led];

  if (!IS_DEVELOPER_BOOT_MODE())
  {
    if ((led == LED1_GPIO_PORT && pin == LED1_PIN &&
         ResMgr_Release(LED1_GPIO_RIF_RES_TYP_GPIO, LED1_GPIO_RIF_RES_NUM_GPIO) != RESMGR_STATUS_ACCESS_OK)
        || (led == LED2_GPIO_PORT && pin == LED2_PIN &&
            ResMgr_Release(LED2_GPIO_RIF_RES_TYP_GPIO, LED2_GPIO_RIF_RES_NUM_GPIO) != RESMGR_STATUS_ACCESS_OK)
        || (led == LED3_GPIO_PORT && pin == LED3_PIN &&
            ResMgr_Release(LED3_GPIO_RIF_RES_TYP_GPIO, LED3_GPIO_RIF_RES_NUM_GPIO) != RESMGR_STATUS_ACCESS_OK)
        || (led == LED4_GPIO_PORT && pin == LED4_PIN &&
            ResMgr_Release(LED4_GPIO_RIF_RES_TYP_GPIO, LED4_GPIO_RIF_RES_NUM_GPIO) != RESMGR_STATUS_ACCESS_OK))
    {
      ret = BSP_ERROR_MSP_FAILURE;
    }
  }
  return ret;
}

/**
  * @brief  Turns selected LED On.
  * @param  Led LED to be set on
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t  BSP_LED_On(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;

  HAL_GPIO_WritePin(LED_PORT [Led], (uint16_t)LED_PIN [Led], GPIO_LED_ON[Led]);
  return ret;
}

/**
  * @brief  Turns selected LED Off.
  * @param  Led LED to be set off
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t  BSP_LED_Off(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
  HAL_GPIO_WritePin(LED_PORT [Led], (uint16_t)LED_PIN [Led], GPIO_LED_OFF[Led]);
  return ret;
}

/**
  * @brief  Toggles the selected LED.
  * @param  Led LED to be toggled
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval BSP status
  */
int32_t  BSP_LED_Toggle(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
  HAL_GPIO_TogglePin(LED_PORT[Led], (uint16_t)LED_PIN[Led]);
  return ret;
}
/**
  * @brief  Get the selected LED state.
  * @param  Led LED to be get its state
  *          This parameter can be one of the following values:
  *            @arg  LED1
  *            @arg  LED2
  *            @arg  LED3
  *            @arg  LED4
  * @retval LED status
  */
int32_t BSP_LED_GetState(Led_TypeDef Led)
{
  int32_t ret = BSP_ERROR_NONE;
  ret = (int32_t)HAL_GPIO_ReadPin(LED_PORT [Led], (uint16_t)LED_PIN [Led]);
  return ret;
}

/**
  * @brief  Configures button GPIO and EXTI Line.
  * @param  Button Button to be configured
  *          This parameter can be one of the following values:
  *            @arg  BUTTON_WAKEUP: Wakeup Push Button
  * @param  ButtonMode Button mode
  *          This parameter can be one of the following values:
  *            @arg  BUTTON_MODE_GPIO: Button will be used as simple IO
  *            @arg  BUTTON_MODE_EXTI: Button will be connected to EXTI line
  *                                    with interrupt generation capability
  * @retval BSP status
  */
int32_t  BSP_PB_Init(Button_TypeDef Button, ButtonMode_TypeDef ButtonMode)
{
  GPIO_InitTypeDef gpio_init_structure;
  static BSP_EXTI_LineCallback ButtonCallback[BUTTONn] = {BUTTON_WAKEUP_EXTI_Callback, BUTTON_USER1_EXTI_Callback,
                                                          BUTTON_USER2_EXTI_Callback, BUTTON_TAMPER_EXTI_Callback
                                                         };
  static uint32_t  BSP_BUTTON_PRIO [BUTTONn] = {BSP_BUTTON_WAKEUP_IT_PRIORITY, BSP_BUTTON_USER_IT_PRIORITY,
                                                BSP_BUTTON_USER_IT_PRIORITY, BSP_BUTTON_TAMPER_IT_PRIORITY
                                               };
  static const uint32_t BUTTON_EXTI_LINE[BUTTONn] = {BUTTON_WAKEUP_EXTI_LINE, BUTTON_USER1_EXTI_LINE,
                                                     BUTTON_USER2_EXTI_LINE, BUTTON_TAMPER_EXTI_LINE
                                                    };

  /*BSP PB Msp Init Configuration*/
  if (BSP_PB_MspInit(Button) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_MSP_FAILURE;
  }

  /* Enable the BUTTON clock*/
  BUTTON_USER2_GPIO_CLK_ENABLE();
  gpio_init_structure.Pin = BUTTON_PIN [Button];
  gpio_init_structure.Pull = GPIO_NOPULL;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;

