STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP257F-DK/stm32mp257f_disco.c
  if (ButtonMode == BUTTON_MODE_GPIO)
  {
    /* Configure Button pin as input */
    gpio_init_structure.Mode = GPIO_MODE_INPUT;
    HAL_GPIO_Init(BUTTON_PORT [Button], &gpio_init_structure);
  }
  else /* (ButtonMode == BUTTON_MODE_EXTI) */
  {
    /* Configure Button pin as input with External interrupt */
    gpio_init_structure.Mode = GPIO_MODE_IT_RISING;

    HAL_GPIO_Init(BUTTON_PORT[Button], &gpio_init_structure);

    (void)HAL_EXTI_GetHandle(&hpb_exti[Button], BUTTON_EXTI_LINE[Button]);
    (void)HAL_EXTI_RegisterCallback(&hpb_exti[Button],  HAL_EXTI_COMMON_CB_ID, ButtonCallback[Button]);

    /* Enable and set Button EXTI Interrupt to the lowest priority */
#if defined(CORE_CA35)
    IRQ_SetPriority((BUTTON_IRQn[Button]), BSP_BUTTON_PRIO[Button]);
    IRQ_Enable((BUTTON_IRQn[Button]));
#else
    HAL_NVIC_SetPriority((BUTTON_IRQn[Button]), BSP_BUTTON_PRIO[Button], 0x00);
    HAL_NVIC_EnableIRQ((BUTTON_IRQn[Button]));
#endif /* CORE_CA35 */
  }
  return BSP_ERROR_NONE;
}

/**
  * @brief  Push Button DeInit.
  * @param  Button Button to be configured
  *          This parameter can be one of the following values:
  *            @arg  BUTTON_WAKEUP: Wakeup Push Button
  * @note PB DeInit does not disable the GPIO clock
  * @retval BSP status
  */
int32_t BSP_PB_DeInit(Button_TypeDef Button)
{
  GPIO_InitTypeDef gpio_init_structure;

  gpio_init_structure.Pin = BUTTON_PIN[Button];
#if defined(CORE_CA35)
  IRQ_Disable((IRQn_Type)(BUTTON_IRQn[Button]));
#else
  HAL_NVIC_DisableIRQ((IRQn_Type)(BUTTON_IRQn[Button]));
#endif /* CORE_CA35 */
  HAL_GPIO_DeInit(BUTTON_PORT[Button], gpio_init_structure.Pin);


  /* BSP PB  MSP DeInit configuration*/
  if (BSP_PB_MspDeInit(Button) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_MSP_FAILURE;
  }

  return BSP_ERROR_NONE;
}

/**
  * @brief  MspInit Buttons.
  * @param  Button Button to be configured
  *          This parameter can be one of the following values:
  *            @arg  BUTTON_WAKEUP: Wakeup Push Button
  *            @arg  BUTTON_TAMPER: Tamper Push Button
  *            @arg  BUTTON_USER1 : User1 Push Button
  *            @arg  BUTTON_USER2 : User2 Push Button
  * @retval int32_t
  */
static int32_t BSP_PB_MspInit(Button_TypeDef Button)
{
  int32_t ret = BSP_ERROR_NONE;
  GPIO_TypeDef *button = BUTTON_PORT[Button];
  uint16_t pin = BUTTON_PIN[Button];

  /* Enable the BUTTON clock*/
  if (Button == BUTTON_WAKEUP && !(BUTTON_WAKEUP_GPIO_IS_CLK_ENABLE()))
  {
    if (RESMGR_STATUS_ACCESS_OK == ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(90)))
    {
      BUTTON_WAKEUP_GPIO_CLK_ENABLE();
    }
  }
  else if (Button == BUTTON_TAMPER && !(BUTTON_TAMPER_GPIO_IS_CLK_ENABLE()))
  {
    if (RESMGR_STATUS_ACCESS_OK == ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(101)))
    {
      BUTTON_TAMPER_GPIO_CLK_ENABLE();
    }
  }
  else if (Button == BUTTON_USER1 && !(BUTTON_USER1_GPIO_IS_CLK_ENABLE()))
  {
    if (IS_DEVELOPER_BOOT_MODE())
    {
      HAL_PWR_EnableBkUpD3Access();
      HAL_PWREx_EnableSupply(PWR_PVM_VDDIO3);
    }
    if (RESMGR_STATUS_ACCESS_OK == ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(92)))
    {
      BUTTON_USER1_GPIO_CLK_ENABLE();
    }
  }
  else if (Button == BUTTON_USER2 && !(BUTTON_USER2_GPIO_IS_CLK_ENABLE()))
  {
    if (RESMGR_STATUS_ACCESS_OK == ResMgr_Request(RESMGR_RESOURCE_RIF_RCC, RESMGR_RCC_RESOURCE(92)))
    {
      BUTTON_USER2_GPIO_CLK_ENABLE();
    }
  }

  if (!IS_DEVELOPER_BOOT_MODE())
  {
    if ((button == BUTTON_WAKEUP_GPIO_PORT && pin == BUTTON_WAKEUP_PIN &&
         ResMgr_Request(BUTTON_WAKEUP_RIF_RES_TYP_GPIO, BUTTON_WAKEUP_RIF_RES_NUM_GPIO) != RESMGR_STATUS_ACCESS_OK)
        || (button == BUTTON_TAMPER_GPIO_PORT && pin == BUTTON_TAMPER_PIN &&
            ResMgr_Request(BUTTON_TAMPER_RIF_RES_TYP_GPIO, BUTTON_TAMPER_RIF_RES_NUM_GPIO) != RESMGR_STATUS_ACCESS_OK)
        || (button == BUTTON_USER1_GPIO_PORT && pin == BUTTON_USER1_PIN &&
            ResMgr_Request(BUTTON_USER1_RIF_RES_TYP_GPIO, BUTTON_USER1_RIF_RES_NUM_GPIO) != RESMGR_STATUS_ACCESS_OK)
        || (button == BUTTON_USER2_GPIO_PORT && pin == BUTTON_USER2_PIN &&
            ResMgr_Request(BUTTON_USER2_RIF_RES_TYP_GPIO, BUTTON_USER2_RIF_RES_NUM_GPIO) != RESMGR_STATUS_ACCESS_OK))
    {
      ret = BSP_ERROR_MSP_FAILURE;
    }
  }
  return ret;
}

/**
  * @brief  MspDeInit BUTTONs.
  * @param  Button BUTTON to be configured.
  *          This parameter can be one of the following values:
  *            @arg  BUTTON_WAKEUP: Wakeup Push Button
  *            @arg  BUTTON_TAMPER: Tamper Push Button
  *            @arg  BUTTON_USER1 : User1 Push Button
  *            @arg  BUTTON_USER2 : User2 Push Button
  * @retval int32_t
  */
static int32_t BSP_PB_MspDeInit(Button_TypeDef Button)
{
  int32_t ret = BSP_ERROR_NONE;
  GPIO_TypeDef *button = BUTTON_PORT[Button];
  uint16_t pin = BUTTON_PIN[Button];

  if (!IS_DEVELOPER_BOOT_MODE())
  {
    if ((button == BUTTON_WAKEUP_GPIO_PORT && pin == BUTTON_WAKEUP_PIN &&
         ResMgr_Release(BUTTON_WAKEUP_RIF_RES_TYP_GPIO, BUTTON_WAKEUP_RIF_RES_NUM_GPIO) != RESMGR_STATUS_ACCESS_OK)
        || (button == BUTTON_TAMPER_GPIO_PORT && pin == BUTTON_TAMPER_PIN &&
            ResMgr_Release(BUTTON_TAMPER_RIF_RES_TYP_GPIO, BUTTON_TAMPER_RIF_RES_NUM_GPIO) != RESMGR_STATUS_ACCESS_OK)
        || (button == BUTTON_USER1_GPIO_PORT && pin == BUTTON_USER1_PIN &&
            ResMgr_Release(BUTTON_USER1_RIF_RES_TYP_GPIO, BUTTON_USER1_RIF_RES_NUM_GPIO) != RESMGR_STATUS_ACCESS_OK)
        || (button == BUTTON_USER2_GPIO_PORT && pin == BUTTON_USER2_PIN &&
            ResMgr_Release(BUTTON_USER2_RIF_RES_TYP_GPIO, BUTTON_USER2_RIF_RES_NUM_GPIO) != RESMGR_STATUS_ACCESS_OK))
    {
      ret = BSP_ERROR_MSP_FAILURE;
    }
  }
  return ret;
}

/**
  * @brief  Returns the selected button state.
  * @param  Button Button to be checked
  *          This parameter can be one of the following values:
  *            @arg  BUTTON_WAKEUP: Wakeup Push Button
  * @retval The Button GPIO pin value
  */
int32_t BSP_PB_GetState(Button_TypeDef Button)
{
  return HAL_GPIO_ReadPin(BUTTON_PORT[Button], BUTTON_PIN[Button]);
}

/**
  * @brief  This function handles Push-Button interrupt requests.
  * @param  Button Specifies the pin connected EXTI line
  * @retval None
  */
void BSP_PB_IRQHandler(Button_TypeDef Button)
{
  HAL_EXTI_IRQHandler(&hpb_exti[Button]);
}

/**
  * @brief  KEY EXTI line detection callbacks.
  * @retval None
  */
static void BUTTON_WAKEUP_EXTI_Callback(void)
{
  BSP_PB_Callback(BUTTON_WAKEUP);
}
/**
  * @brief  KEY EXTI line detection callbacks.
  * @retval None
  */
static void BUTTON_USER1_EXTI_Callback(void)
{
  BSP_PB_Callback(BUTTON_USER1);
}
/**
  * @brief  KEY EXTI line detection callbacks.
  * @retval None
  */
static void BUTTON_USER2_EXTI_Callback(void)
{
  BSP_PB_Callback(BUTTON_USER2);
}
/**
  * @brief  KEY EXTI line detection callbacks.
  * @retval None
  */
static void BUTTON_TAMPER_EXTI_Callback(void)
{
  BSP_PB_Callback(BUTTON_TAMPER);
}
/**
  * @brief  BSP Push Button callback
  * @param  Button Specifies the pin connected EXTI line
  * @retval None.
  */
__weak void BSP_PB_Callback(Button_TypeDef Button)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Button);
  /* This function should be implemented by the user application.
  It is called into this driver when an event on Button is triggered. */
}
#endif /* defined (CORE_CA35) || defined (CORE_CM33) */

#if (USE_BSP_COM_FEATURE > 0)
/**
  * @brief  Configures COM port.
  * @param  COM COM port to be configured.
  *          This parameter can be COM1, COM2, COM3
  * @param  COM_Init Pointer to a UART_HandleTypeDef structure that contains the
  *                configuration information for the specified USART peripheral.
  * @retval BSP status
  */
int32_t BSP_COM_Init(COM_TypeDef COM, COM_InitTypeDef *COM_Init)
{
  int32_t ret = BSP_ERROR_NONE;

